---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn1
source: html/fbf3ae42-f2bb-c79c-01e3-bac772579ba6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn1 Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistn1 { get; }
```